api/app/controllers/users_controller.rb

  def create

    params_to_save = {
      name:                   params[:name],
      email:                  params[:email],
      password:               params[:password],
      password_confirmation:  params[:password_confirmation]
    }

    # @user = User.new(params[:user])
    @user = User.new(params_to_save)

    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-09-22 20:18:15.267741"], ["updated_at", "2014-09-22 20:18:15.267741"]]